# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'awscli'
brew 'git'
brew 'hub'
brew 'tree'
brew 'trash'
brew 'macup'
brew 'wget'

# Development
brew 'nvm'
brew 'android-sdk'

# Apps
cask 'aerial'
cask 'alfred'
cask 'android-studio'
cask 'arduino'
cask 'bettertouchtool'
cask 'calibre'
cask 'caffeine'
cask 'citrix-receiver'
cask 'dropbox'
cask 'firefox'
cask 'gimp'
cask 'google-chrome'
cask 'inkscape'
cask 'iterm2'
cask 'java'
cask 'sdformatter'
cask 'sequel-pro'
cask 'seil'
cask 'skype'
cask 'skype-for-business'
cask 'starleaf-breeze'
cask 'steam'
cask 'sublime-text'
cask 'the-unarchiver'
cask 'tower'
cask 'transmit'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-sauce-code-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'